Revit 2027 API
RoofBase.EaveCuts Property
Retrieve or set the EaveCutterType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EaveCutterType EaveCuts { get; set; }
Public Property EaveCuts As EaveCutterType
	Get
	Set
public:
property EaveCutterType EaveCuts {
	EaveCutterType get ();
	void set (EaveCutterType value);
}
member EaveCuts : EaveCutterType with get, set
Property Value
EaveCutterType
See Also
Reference
RoofBase Class
Autodesk.Revit.DB Namespace